// Вариант 8.
// Дана последовательность натуpальных чисел {Aj}. Hайти произведение чисел, не делящихся на 5, наибольшее из таких чисел и номеp этого числа в последовательности.

#include <iostream>
using std::cout;
using std::cin;
using std::endl;

int main()
{
    int j;
    cout << "Enter the amount of numbers:" << endl, cin >> j;

    int A[j];
    cout << "Enter the numbers:" << endl;

    for (int i = 0; i < j; i++) {
        cin >> A[i];
    }



}

